---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions
source: html/30b0d5b1-6349-c849-be08-d316c46d65d9.htm
---
# BuildingEnvelopeAnalyzerOptions Properties

Whether or not to analyze interior connected regions inside the building forming enclosed space volumes.